; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-23)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl2)
	(at plane2 city12)
	(fuel-level plane2 fl5)
	(at plane3 city8)
	(fuel-level plane3 fl1)
	(at plane4 city12)
	(fuel-level plane4 fl6)
	(at plane5 city13)
	(fuel-level plane5 fl3)
	(at plane6 city4)
	(fuel-level plane6 fl0)
	(at person1 city4)
	(at person2 city0)
	(at person3 city8)
	(at person4 city5)
	(at person5 city8)
	(at person6 city15)
	(at person7 city15)
	(at person8 city5)
	(at person9 city5)
	(at person10 city1)
	(at person11 city2)
	(at person12 city6)
	(at person13 city2)
	(at person14 city2)
	(at person15 city13)
	(at person16 city14)
	(at person17 city13)
	(at person18 city1)
	(at person19 city5)
	(at person20 city14)
	(at person21 city10)
	(at person22 city2)
	(at person23 city11)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city11)
	(at person1 city12)
	(at person2 city0)
	(at person3 city2)
	(at person4 city12)
	(at person5 city1)
	(at person6 city15)
	(at person7 city7)
	(at person8 city3)
	(at person9 city13)
	(at person10 city15)
	(at person11 city4)
	(at person12 city4)
	(at person13 city13)
	(at person14 city3)
	(at person15 city11)
	(at person16 city11)
	(at person18 city0)
	(at person19 city6)
	(at person20 city7)
	(at person21 city10)
	(at person22 city1)
	(at person23 city3)
	))

)

; plan
1. (refuel plane6 city4 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 3 of 23
2. (board person1 plane6 city4)
   deleted: (at person1 city4)
   added: (in person1 plane6)
   goals met: 3 of 23
3. (fly plane6 city4 city12 fl1 fl0)
   deleted: (at plane6 city4) (fuel-level plane6 fl1)
   added: (at plane6 city12) (fuel-level plane6 fl0)
   goals met: 3 of 23
4. (debark person1 plane6 city12)
   deleted: (in person1 plane6)
   added: (at person1 city12)
   goals met: 4 of 23
5. (board person15 plane5 city13)
   deleted: (at person15 city13)
   added: (in person15 plane5)
   goals met: 4 of 23
6. (zoom plane5 city13 city11 fl3 fl2 fl1)
   deleted: (at plane5 city13) (fuel-level plane5 fl3)
   added: (at plane5 city11) (fuel-level plane5 fl1)
   goals met: 4 of 23
7. (board person23 plane5 city11)
   deleted: (at person23 city11)
   added: (in person23 plane5)
   goals met: 4 of 23
8. (debark person15 plane5 city11)
   deleted: (in person15 plane5)
   added: (at person15 city11)
   goals met: 5 of 23
9. (fly plane5 city11 city3 fl1 fl0)
   deleted: (at plane5 city11) (fuel-level plane5 fl1)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 5 of 23
10. (debark person23 plane5 city3)
   deleted: (in person23 plane5)
   added: (at person23 city3)
   goals met: 6 of 23
11. (board person5 plane3 city8)
   deleted: (at person5 city8)
   added: (in person5 plane3)
   goals met: 6 of 23
12. (board person3 plane3 city8)
   deleted: (at person3 city8)
   added: (in person3 plane3)
   goals met: 6 of 23
13. (board person22 plane1 city2)
   deleted: (at person22 city2)
   added: (in person22 plane1)
   goals met: 6 of 23
14. (board person14 plane1 city2)
   deleted: (at person14 city2)
   added: (in person14 plane1)
   goals met: 6 of 23
15. (board person13 plane1 city2)
   deleted: (at person13 city2)
   added: (in person13 plane1)
   goals met: 6 of 23
16. (board person11 plane1 city2)
   deleted: (at person11 city2)
   added: (in person11 plane1)
   goals met: 6 of 23
17. (fly plane3 city8 city1 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 6 of 23
18. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 6 of 23
19. (debark person5 plane3 city1)
   deleted: (in person5 plane3)
   added: (at person5 city1)
   goals met: 7 of 23
20. (board person18 plane3 city1)
   deleted: (at person18 city1)
   added: (in person18 plane3)
   goals met: 7 of 23
21. (board person10 plane3 city1)
   deleted: (at person10 city1)
   added: (in person10 plane3)
   goals met: 7 of 23
22. (fly plane3 city1 city0 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 7 of 23
23. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 23
24. (debark person18 plane3 city0)
   deleted: (in person18 plane3)
   added: (at person18 city0)
   goals met: 8 of 23
25. (fly plane3 city0 city15 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city15) (fuel-level plane3 fl0)
   goals met: 8 of 23
26. (refuel plane3 city15 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 23
27. (board person7 plane3 city15)
   deleted: (at person7 city15)
   added: (in person7 plane3)
   goals met: 8 of 23
28. (debark person10 plane3 city15)
   deleted: (in person10 plane3)
   added: (at person10 city15)
   goals met: 9 of 23
29. (fly plane3 city15 city2 fl1 fl0)
   deleted: (at plane3 city15) (fuel-level plane3 fl1)
   added: (at plane3 city2) (fuel-level plane3 fl0)
   goals met: 9 of 23
30. (refuel plane3 city2 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 9 of 23
31. (debark person3 plane3 city2)
   deleted: (in person3 plane3)
   added: (at person3 city2)
   goals met: 10 of 23
32. (fly plane3 city2 city7 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 10 of 23
33. (debark person7 plane3 city7)
   deleted: (in person7 plane3)
   added: (at person7 city7)
   goals met: 11 of 23
34. (zoom plane1 city2 city1 fl2 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl2)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 11 of 23
35. (zoom plane2 city12 city14 fl5 fl4 fl3)
   deleted: (at plane2 city12) (fuel-level plane2 fl5)
   added: (at plane2 city14) (fuel-level plane2 fl3)
   goals met: 11 of 23
36. (zoom plane2 city14 city5 fl3 fl2 fl1)
   deleted: (at plane2 city14) (fuel-level plane2 fl3)
   added: (at plane2 city5) (fuel-level plane2 fl1)
   goals met: 11 of 23
37. (board person9 plane2 city5)
   deleted: (at person9 city5)
   added: (in person9 plane2)
   goals met: 11 of 23
38. (board person8 plane2 city5)
   deleted: (at person8 city5)
   added: (in person8 plane2)
   goals met: 11 of 23
39. (board person4 plane2 city5)
   deleted: (at person4 city5)
   added: (in person4 plane2)
   goals met: 11 of 23
40. (board person19 plane2 city5)
   deleted: (at person19 city5)
   added: (in person19 plane2)
   goals met: 11 of 23
41. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 11 of 23
42. (debark person22 plane1 city1)
   deleted: (in person22 plane1)
   added: (at person22 city1)
   goals met: 12 of 23
43. (fly plane2 city5 city12 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 12 of 23
44. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 12 of 23
45. (debark person4 plane2 city12)
   deleted: (in person4 plane2)
   added: (at person4 city12)
   goals met: 13 of 23
46. (fly plane2 city12 city13 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city13) (fuel-level plane2 fl0)
   goals met: 13 of 23
47. (refuel plane2 city13 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 23
48. (debark person9 plane2 city13)
   deleted: (in person9 plane2)
   added: (at person9 city13)
   goals met: 14 of 23
49. (fly plane2 city13 city3 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 14 of 23
50. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 23
51. (debark person8 plane2 city3)
   deleted: (in person8 plane2)
   added: (at person8 city3)
   goals met: 15 of 23
52. (fly plane2 city3 city6 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 15 of 23
53. (debark person19 plane2 city6)
   deleted: (in person19 plane2)
   added: (at person19 city6)
   goals met: 16 of 23
54. (board person12 plane2 city6)
   deleted: (at person12 city6)
   added: (in person12 plane2)
   goals met: 16 of 23
55. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 16 of 23
56. (fly plane2 city6 city4 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 16 of 23
57. (debark person12 plane2 city4)
   deleted: (in person12 plane2)
   added: (at person12 city4)
   goals met: 17 of 23
58. (fly plane1 city1 city11 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 18 of 23
59. (zoom plane4 city12 city14 fl6 fl5 fl4)
   deleted: (at plane4 city12) (fuel-level plane4 fl6)
   added: (at plane4 city14) (fuel-level plane4 fl4)
   goals met: 18 of 23
60. (board person20 plane4 city14)
   deleted: (at person20 city14)
   added: (in person20 plane4)
   goals met: 18 of 23
61. (board person16 plane4 city14)
   deleted: (at person16 city14)
   added: (in person16 plane4)
   goals met: 18 of 23
62. (zoom plane4 city14 city11 fl4 fl3 fl2)
   deleted: (at plane4 city14) (fuel-level plane4 fl4)
   added: (at plane4 city11) (fuel-level plane4 fl2)
   goals met: 18 of 23
63. (debark person16 plane4 city11)
   deleted: (in person16 plane4)
   added: (at person16 city11)
   goals met: 19 of 23
64. (zoom plane4 city11 city7 fl2 fl1 fl0)
   deleted: (at plane4 city11) (fuel-level plane4 fl2)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 19 of 23
65. (debark person20 plane4 city7)
   deleted: (in person20 plane4)
   added: (at person20 city7)
   goals met: 20 of 23
66. (refuel plane1 city11 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 20 of 23
67. (fly plane1 city11 city13 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl1)
   added: (at plane1 city13) (fuel-level plane1 fl0)
   goals met: 19 of 23
68. (refuel plane1 city13 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 19 of 23
69. (debark person13 plane1 city13)
   deleted: (in person13 plane1)
   added: (at person13 city13)
   goals met: 20 of 23
70. (fly plane1 city13 city3 fl1 fl0)
   deleted: (at plane1 city13) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 20 of 23
71. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 20 of 23
72. (debark person14 plane1 city3)
   deleted: (in person14 plane1)
   added: (at person14 city3)
   goals met: 21 of 23
73. (fly plane1 city3 city4 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 21 of 23
74. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 21 of 23
75. (debark person11 plane1 city4)
   deleted: (in person11 plane1)
   added: (at person11 city4)
   goals met: 22 of 23
76. (fly plane1 city4 city11 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 23 of 23
